<a href="https://colab.research.google.com/github/NedduJS/data-manipulation-pandas/blob/main/DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

In [6]:
import numpy as np

In [3]:
pd.__version__

'1.3.0'

In [7]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

In [8]:
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [10]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [11]:
df.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [12]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [13]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [16]:
df[['pais','Q1']]

         pais    Q1
ana        co   5.0
benito     mx  10.0
camilo     co   8.0
daniel     mx   NaN
erika      mx   7.0
fabian     ch   8.0
gabriela   ch   3.0

In [18]:
df.loc['benito',['pais','Q1']]

pais      mx
Q1      10.0
Name: benito, dtype: object

In [19]:
df.loc[['daniel', 'fabian'],['edad', 'Q2']]

        edad  Q2
daniel    14   8
fabian    11   8

In [20]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [21]:
df.iloc[1,0]

9

In [22]:
df.iloc[3,[0,3]]

edad      14
genero     M
Name: daniel, dtype: object

In [23]:
df.iloc[:, [0,2,4]]

          edad pais    Q1
ana         10   co   5.0
benito       9   mx  10.0
camilo      13   co   8.0
daniel      14   mx   NaN
erika       12   mx   7.0
fabian      11   ch   8.0
gabriela    12   ch   3.0

In [24]:
df['edad']>=12

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [25]:
df[df['edad']>=12]

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9

In [29]:
df[(df['edad']>=11) & (df.iloc[:,2]=='ch')]

          edad   cm pais genero   Q1  Q2
fabian      11  120   ch      M  8.0   8
gabriela    12  125   ch      F  3.0   9

In [30]:
df.query('Q1<7')

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
gabriela    12  125   ch      F  3.0   9

In [31]:
df[df['Q1'] <= df['Q2']]

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
fabian      11  120   ch      M  8.0   8
gabriela    12  125   ch      F  3.0   9